//=========================================================
//
// アウトラインシェーダー
// Author : Asuma Nishio
//
//=========================================================

//*********************************************************
// シェーダー内グローバル変数
//*********************************************************
float4x4 g_mtxViewProj; // ビューとプロジェクションの掛け合わせ
float g_fOutlineWidth; // アウトラインの太さ
float4 g_Color;

//=========================================================
// 入出力構造体
//=========================================================
struct VS_IN
{
    float4 pos : POSITION;
    float3 normal : NORMAL;
};

struct VS_OUT
{
    float4 pos : POSITION;
};

//=========================================================
// 頂点シェーダーエントリーポイント
//=========================================================
VS_OUT VS_Main(VS_IN v_in)
{
    VS_OUT Out;

    // 各頂点のローカル座標方向への拡大
    float4 pos = v_in.pos + float4(v_in.normal.xyz * g_fOutlineWidth, 0);

    // WVP変換
    Out.pos = mul(pos, g_mtxViewProj);

    return Out;
}

//=========================================================
// ピクセルシェーダーエントリ－ポイント
//=========================================================
float4 PS_Main() : COLOR
{
    return g_Color;
}

//=========================================================
// テクニック宣言
//=========================================================
technique OutLine
{
    pass P0
    {
        VertexShader = compile vs_3_0 VS_Main();
        PixelShader = compile ps_3_0 PS_Main();
    }
}