//=========================================================
//
// ブロック管理処理 [ blockmanager.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "blockmanager.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "jsonmanager.h"
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CBlockManager::CBlockManager() : m_pBlocks{}
{

}
//=========================================================
// デストラクタ
//=========================================================
CBlockManager::~CBlockManager()
{
	Uninit();
}
//=========================================================
// ブロック生成関数
//=========================================================
CBlock* CBlockManager::CreateManager
(
	const D3DXVECTOR3& pos, 
	const D3DXVECTOR3& rot, 
	const D3DXVECTOR3& scale, 
	const char* pModelName
)
{
	// インスタンス生成
	CBlock* pNewBlock = CBlock::Create(pos, rot, scale, pModelName);

	// 配列に追加
	if (pNewBlock) m_pBlocks.push_back(pNewBlock);

	return pNewBlock;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CBlockManager::Init(void)
{
	// 配列のクリア
	m_pBlocks.clear();

	// ファイル読み込み
	Load();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CBlockManager::Uninit(void)
{
	// 配列のクリア
	m_pBlocks.clear();
}
//=========================================================
// 更新処理
//=========================================================
void CBlockManager::Update(void)
{
	
}
//=========================================================
// json読み込み
//=========================================================
HRESULT CBlockManager::Load(void)
{
	// jsonファイル読み込み
	auto jsonmanager = CManager::GetInstance()->GetJsonManager();
	jsonmanager->Load(FILE_NAME);

	return S_OK;
}