//===================================================================
//
// 各種キャラクターをJsonから生成する処理 [ createjsoncharactor.cpp ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// クラス定義ヘッダーファイル
//*******************************************************************
#include "createjsoncharactor.h"

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "createjsonnomove.h"

//===================================================================
// 生成処理
//===================================================================
void CJsonCreateCharactor::Create(const json& Jsondata)
{
	// タグの一致を見る
	std::string type = Jsondata["Charactortag"];

	// 動かないキャラクターの生成
	if (type == "NoMove") CJsonCreateNoMove::Create(Jsondata);
}