//=========================================================
//
// ゴール処理 [ goal.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "goal.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "spherecollider.h"
#include "boxcollider.h"
#include "boxtospherecollision.h"

//=========================================================
// コンストラクタ
//=========================================================
CGoal::CGoal(int nPriority) : CObjectX(nPriority),
m_pSphereCollider(nullptr)
{

}
//=========================================================
// デストラクタ
//=========================================================
CGoal::~CGoal()
{

}
//=========================================================
// 生成関数
//=========================================================
CGoal* CGoal::Create(const D3DXVECTOR3& pos)
{
	// インスタンス生成
	CGoal* pGoal = new CGoal;
	if (pGoal == nullptr) return nullptr;

	// オブジェクト設定
	pGoal->SetPos(pos);
	pGoal->SetFilePass(Config::MODELNAME);

	// 初期化失敗時
	if (FAILED(pGoal->Init())) return nullptr;

	return pGoal;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CGoal::Init(void)
{
	// 親クラスの初期化
	CObjectX::Init();

	// コライダー生成
	m_pSphereCollider = CSphereCollider::Create(GetPos(), Config::RADIUS);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CGoal::Uninit(void)
{
	// コライダー破棄
	m_pSphereCollider.reset();

	// 親クラスの終了処理
	CObjectX::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CGoal::Update(void)
{
	// 親クラスの更新処理
	CObjectX::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CGoal::Draw(void)
{
	// 親クラスの描画処理
	CObjectX::Draw();
}
//=========================================================
// 当たり判定関数
//=========================================================
bool CGoal::Collision(CBoxCollider* other)
{
	// nullなら失敗
	if (m_pSphereCollider == nullptr) return false;

	return CBoxToSphereCollision::Collision(other,m_pSphereCollider.get());
}
