//=========================================================
//
// ロックオンのビルボード [ lockonui.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "lockonui.h"

//=========================================================
// コンストラクタ
//=========================================================
CLockOnUi::CLockOnUi(int nPriority) : CBillboard(nPriority),
m_isDraw(false)
{

}
//=========================================================
// デストラクタ
//=========================================================
CLockOnUi::~CLockOnUi()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CLockOnUi::Init(void)
{
	CBillboard::Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CLockOnUi::Uninit(void)
{
	CBillboard::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CLockOnUi::Update(void)
{
	if (!m_isDraw) return;

	CBillboard::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CLockOnUi::Draw(void)
{
	if (!m_isDraw) return;

	CBillboard::Draw();
}
//=========================================================
// 生成処理
//=========================================================
CLockOnUi* CLockOnUi::Create
(
	const D3DXVECTOR3& pos, 
	const D3DXVECTOR3& rot, 
	const D3DXVECTOR2& size, 
	const char* TexName
)
{
	// 生成
	CLockOnUi* pUi = new CLockOnUi;
	if (pUi == nullptr) return nullptr;

	// 設定
	pUi->SetTexture(TexName);
	pUi->SetPos(pos);
	pUi->SetRot(rot);
	pUi->SetSize(size.x, size.y);
	
	// 初期化失敗時
	if (FAILED(pUi->Init())) return nullptr;

	return pUi;
}