//=========================================================
//
// 負けリザルトシーン処理 [ loseresult.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "loseresult.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "loseresultmanager.h"
#include "loseresultobject.h"

//=========================================================
// コンストラクタ
//=========================================================
CLoseResult::CLoseResult() : CScene(CScene::MODE_LOSERESULT)
{
	
}
//=========================================================
// デストラクタ
//=========================================================
CLoseResult::~CLoseResult()
{
	
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CLoseResult::Init(void)
{
	// 負けリザルトマネージャーの初期化処理
	CLoseResultManager::GetInstance()->Init();

	// 負けリザルトオブジェクトの初期化処理
	CLoseResultObject::GetInstance()->Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CLoseResult::Uninit(void)
{
	// 負けリザルトマネージャーの終了処理
	CLoseResultManager::GetInstance()->Uninit();

	// 負けリザルトオブジェクトの終了処理
	CLoseResultObject::GetInstance()->Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CLoseResult::Update(void)
{
	// 負けリザルトマネージャーの更新処理
	CLoseResultManager::GetInstance()->Update();
}
//=========================================================
// 描画処理
//=========================================================
void CLoseResult::Draw(void)
{

}