//=========================================================
//
// リザルトシーン処理 [ result.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "result.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "resultmanager.h"
#include "resultobject.h"

//=========================================================
// オーバーロードコンストラクタ
//=========================================================
CResult::CResult() : CScene(CScene::MODE_RESULT)
{

}
//=========================================================
// デストラクタ
//=========================================================
CResult::~CResult()
{
	
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CResult::Init(void)
{
	// リザルトマネージャーの初期化
	CResultManager::GetInstance()->Init();

	// リザルトオブジェクトの初期化
	CResultObject::GetInstance()->Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CResult::Uninit(void)
{
	// リザルトオブジェクトの破棄
	CResultObject::GetInstance()->Uninit();

	// リザルトマネージャーの終了処理
	CResultManager::GetInstance()->Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CResult::Update(void)
{
	// リザルトマネージャーの更新処理
	CResultManager::GetInstance()->Update();
}
//=========================================================
// 描画処理
//=========================================================
void CResult::Draw(void)
{

}