//=========================================================
//
// コライダー基底処理 [ collider.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// コライダー基底クラスを定義
//*********************************************************
class CCollider
{
public:

	CCollider();
	virtual ~CCollider();

	void SetPos(D3DXVECTOR3 pos) { m_pos = pos; }
	D3DXVECTOR3 GetPos(void) const { return m_pos; }

protected:

	D3DXVECTOR3 m_pos; // コライダー設定用座標
};