//=========================================================
//
// 球形当たり判定処理 [ collisionsphere.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "collision.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CSphereCollider;

//*********************************************************
// 球形同士の当たり判定処理
//*********************************************************
class CCollisionSphere : public CCollision
{
public:

	CCollisionSphere();
	~CCollisionSphere();

	/// <summary>
	/// 球形同士の当たり判定関数
	/// </summary>
	/// <param name="thisCollider">自分が持ってる球コライダー</param>
	/// <param name="otherCollider">判定先の球コライダー</param>
	/// <returns></returns>
	static bool Collision
	(
		CSphereCollider * thisCollider, 
		CSphereCollider * otherCollider
	);

private:

};