//=========================================================
//
// UIオブジェクトをJsonから生成する処理 [ createjsonui.h ]
// Author: Asuma Nishio
//
//==========================================================

//**********************************************************
// インクルードガード
//**********************************************************
#pragma once

//**********************************************************
// インクルードファイル
//**********************************************************
#include "jsoncreator.h"

//**********************************************************
// UIオブジェクトをJsonから生成するクラスを定義
//**********************************************************
class CJsonCreateUi : public CJsonCreator
{
public:

	CJsonCreateUi() = default;
	~CJsonCreateUi() = default;

	/// <summary>
	/// UIを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};