//===================================================================
//
// 敵をJsonから生成する処理 [ createjsonenemy.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// 敵をJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateEnemy : public CJsonCreator
{
public:

	CJsonCreateEnemy() = default;
	~CJsonCreateEnemy() = default;

	/// <summary>
	/// 敵を生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};