//===================================================================
//
// ポインタブロックをJsonから生成する処理 [ createjsonblock.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// ポインタブロックをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateBlock : public CJsonCreator
{
public:

	CJsonCreateBlock() = default;
	~CJsonCreateBlock() = default;

	/// <summary>
	/// ブロックを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};