//===================================================================
//
// メッシュフィールドをJsonから生成する処理 [ createjsonmeshfield.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// メッシュフィールドをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateMeshField : public CJsonCreator
{
public:

	CJsonCreateMeshField() = default;
	~CJsonCreateMeshField() = default;

	/// <summary>
	/// メッシュフィールドを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};