//===================================================================
//
// 通常ブロックをJsonから生成する処理 [ createjsonblocknormal.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// 通常ブロックをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateBlockNormal : public CJsonCreator
{
public:

	CJsonCreateBlockNormal() = default;
	~CJsonCreateBlockNormal() = default;

	/// <summary>
	/// ブロックを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};