//===================================================================
//
// メッシュドームをJsonから生成する処理 [ createjsonmeshdome.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// メッシュドームをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateMeshDome : public CJsonCreator
{
public:

	CJsonCreateMeshDome() = default;
	~CJsonCreateMeshDome() = default;

	/// <summary>
	/// メッシュドームを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};