//===================================================================
//
// 壁モデルをJsonから生成する処理 [ createjsonwall.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// 壁モデルをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateWall : public CJsonCreator
{
public:

	CJsonCreateWall() = default;
	~CJsonCreateWall() = default;

	/// <summary>
	/// 壁モデルを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};