//===================================================================
//
// 各種キャラクターをJsonから生成する処理 [ createjsoncharactor.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// キャラクターをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateCharactor : public CJsonCreator
{
public:

	CJsonCreateCharactor() = default;
	~CJsonCreateCharactor() = default;

	/// <summary>
	/// キャラクターを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};