//===================================================================
//
// 動かないキャラクターをJsonから生成する処理 [ createjsoncharactor.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include <json.hpp>

//*******************************************************************
// 名前空間を定義
//*******************************************************************
namespace JsonNoMove
{
	using json = nlohmann::json;
};

//*******************************************************************
// 動かないキャラクターをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateNoMove
{
public:

	CJsonCreateNoMove() = default;
	~CJsonCreateNoMove() = default;

	/// <summary>
	/// 生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	static void Create(const JsonNoMove::json& Jsondata);

private:
};