//===================================================================
//
// マーカーをJsonから生成する処理 [ createjsonmaker.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// マーカーをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateMaker : public CJsonCreator
{
public:

	CJsonCreateMaker() = default;
	~CJsonCreateMaker() = default;

	/// <summary>
	/// マーカーを生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};