//=========================================================
//
// ライト処理 [ light.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// ライトクラスを定義
//*********************************************************
class CLight
{
public:

	CLight();
	~CLight();

	HRESULT Init(void);
	void Uninit(void) {};
	void Update(void) {};

private:
	static inline constexpr int NUMLIGHT = 3;		// 設置する数

	D3DLIGHT9 m_aLight[NUMLIGHT];   // ライト数
	D3DXVECTOR3 m_vecDir[NUMLIGHT];	// ベクトル
};
