//=========================================================
//
// 負けリザルトシーン処理 [ loseresult.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// 負けリザルトシーンクラスを定義
//*********************************************************
class CLoseResult : public CScene
{
public:

	CLoseResult();
	~CLoseResult();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
};