//=========================================================
//
// ランキングシーン処理 [ ranking.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// ランキングシーンクラスを定義
//*********************************************************
class CRanking : public CScene
{
public:

	CRanking();
	~CRanking();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
};