//=========================================================
//
// リザルトシーン処理 [ result.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// リザルトシーンクラスを定義
//*********************************************************
class CResult : public CScene
{
public:

	CResult();
	~CResult();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:

};