//=========================================================
//
// リザルトのオブジェクト管理 [ resultobject.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************
class CResultScoreManager;
class CBlockManager;

//*********************************************************
// リザルトで使うオブジェクトを管理するクラスを定義
//*********************************************************
class CResultObject
{
public:

	~CResultObject();

	HRESULT Init(void);
	void Uninit(void);

	/// <summary>
	/// インスタンス取得処理
	/// </summary>
	/// <param name=""></param>
	/// <returns></returns>
	static CResultObject* GetInstance(void);

private:

	CResultObject();

	static CResultObject* m_pInstance;	// シングルトン変数

	std::unique_ptr<CBlockManager>m_pBlock;						// ステージマップ
};