//=========================================================
//
// タイトルシーンに関する処理 [ title.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// タイトルシーンクラスを定義
//*********************************************************
class CTitle :public CScene
{
public:

	CTitle();
	~CTitle();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:

};