//=========================================================
//
// チュートリアル管理処理 [ tutorialmanager.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// チュートリアル管理クラスを定義
//*********************************************************
class CTutorialManager
{
public:

	~CTutorialManager();
	
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	static CTutorialManager* GetInstance(void);

private:

	CTutorialManager();		// 格納コンストラクタ
};