//=========================================================
//
// チュートリアル処理 [ tutorial.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// チュートリアルシーンクラスを定義
//*********************************************************
class CTutorial : public CScene
{
public:

	CTutorial();
	~CTutorial();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:

};